fasteddy516/circuitpython/ports/raspberrypi/boards/fasteddy516_pico_w_shelflight/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ShelfLight (Raspberry Pi Pico W)"
#define MICROPY_HW_MCU_NAME "rp2040"

#define CIRCUITPY_DIGITALIO_HAVE_INVALID_PULL (1)
#define CIRCUITPY_DIGITALIO_HAVE_INVALID_DRIVE_MODE (1)

#define MICROPY_HW_LED_STATUS   (&pin_CYW0)

#define CIRCUITPY_BOARD_I2C         (1)
#define CIRCUITPY_BOARD_I2C_PIN     {{.scl = &pin_GPIO5, .sda = &pin_GPIO4}}
